{"meta":{"title":"噪音制造坞","subtitle":"let's hit it！","description":"","author":"沈楠","url":"http://snsnsnsnsnsn.gitee.io/blog","root":"/blog/"},"pages":[{"title":"分类","text":"","path":"categories/index.html"},{"title":"标签","text":"meta name=\"baidu-site-verification\" content=\"fZXlFT02fM\" /","path":"tags/index.html"}],"posts":[{"title":"过去一年的记录","text":"@TOC 方便大家跳着看，如果你觉得“这写的什么玩意”，也可右上退出终于告一段落了，最终也是如愿考上了南航的研究生。难相我呢想借此机会记一个流水账。plus，本人的博客“噪音制造坞”也正式开始运营了，有心的朋友可以来睬一睬，目前评论功能还有些功能不是特别完善，也会逐步完善。 ==感谢各位==首先要感谢一路以来支持我的人（很俗套啊，但是我觉得还是很有必要）。父母自然不必多说了，虽然他们不太懂考研是怎么一回事，还是尽可能地支持我，嗯。还有就是我的女朋友，考研期间给了我很多鼓励，经常来投个食，会一起去图书馆做作业看书这样子，后面政治复习的时候，专程来帮我背书😢。还有啊，是我的三个研友，说是研友，其实更像是吐槽协会。我们几个一天学完，或者中途休息，经常聚在一起开个小会，吹吹牛批，说完之后，又投入到复习当中。如果没有谢到，不代表我把你忘了，因为实在太多了不一一列举。 择校及其原因“罪恶之源”关于选择学校，其实一开始考研，是出于一个很幼稚的理由：我觉得想再过几年读书的生活，其实，自认为本科四年过的比较==本分==，我的室友应该蛮清楚的。明明有一颗想要摇滚的心，却总是不敢跨出这一步。渐渐的，被淡忘被遗弃。等到再要拾起时，却发现已经“脱节”了，身边认识的更多的是，比赛的小伙伴，组里的研究生师兄师姐。在此实名羡慕汪琳建，熟悉他的同学们知道，是我们院的吉他大佬，也是常年混迹江湖。作为他的室友，我也是有幸通过他认识了许多优秀的小伙伴，他们学习很优秀，但是同时坐着自己喜欢的事，做主唱的帅气的鲍鲍，文采一流的小滕，嗓音像张悬的春雨等等。春雨有几次还像大姐头一样教我这那的哈哈，他们让我见识到了生活的另一面，教会了我一个道理—“人各有志”。自那以后，这句话深深刻在我的人生里，我的价值观发生了变化，更深刻地意识到人其实应该往多元化发展。（有几个人没加微信，所以能很不害臊地说出这些话了） 选择自此，我对考研的原则是，中庸之道。所以选了一个难度级别不是特别高的院校。并下决心在研究生期间，跨出这一步。虽然我从小汪那了解到，他乐队的研究生贝斯手排练完就做实验去了，忙得要死。但自己已经做好心理准备，他这样反而也给了我一个先例，即证明我的想法是可行的。数位辅导员曾劝诫我“非南邮即南大”。没有想到的是，班主任和师兄们倒是十分支持我的选择。还有身边的各位。在此十分感谢他们。 趣事其一，缘分妙不可言第一件事，说是趣事，其实也是件遗憾的事情。考研后期，在图书馆学习，不知道是缘分还是什么，一开始的时候，我和一个小哥一直坐面对面。一开始的时候，还挺不好意思地笑一笑，到后来，我俩很默契地给对方占座，有时候去食堂路上碰到的时候，还互相寒暄一下。再后来嘛，有时候谁偷懒没来，就故意刺激他一下，说咋没来啊哈哈。考研的前一天，我俩也是早早收拾了东西，时间点岔开了，以至于都没来得及说一声加油，算是比较遗憾的事情。至今还不知道那个小哥的名字，本来想最后一天留个联系方式，自然也失去了这机会。哎～ 其二，听我娓娓骂来第二件事，关于抢考研教室的。我大老早就听说六级考试完那天，是抢教室的大好时机。我跟研友说了这件事，他俩跟没事人一样，把我气的。于是就自己一个人去占。到教学楼下，我的妈人山人海，旁边人都结伴而来的，心想算了算了，挤都挤不进去。大家抢完之后，立马抓起手机叫了金泽斌（研友兼室友），痛骂一顿（当然也不是真的骂，熟悉我的人都知道，我就只是口头说说，不会往心里去的），说别人都有伴，别人这么早，你考六级已经在教室里了还抢不到，还不帮我抢一个，就整一怨妇哈哈哈。最后嘛，最后被一杯蜜雪冰城打败了，此事才算终了。后来想回来，金泽斌也算挺让着我的了，居然听我吼了近一小时。嘻嘻 其三，不会吧？也是我很纳闷的一件事。就是为什么我好多次被人误解，我有男朋友我不喜欢妹子？？？。有一次是这样的: 师兄：（偷偷把我拉到一边，很神秘地问）上次跟你同行的那个（张焌峰）是不是你男朋友啊 我：？？？，在你眼里我就是这样的人吗 师兄：（笑笑不说话） 我：我到底哪里像了，你说说？？？ 师兄：说不上来，有的时候会有那么一丢丢的错觉 我：。。。一个人就算了，还不止一个人，最离谱的一次是，路上碰到一个推销的小姐姐，我看见张焌峰被她问的一点办法都没有，就上前挺利索地说了几句，结果她反问我一句，“哦这是你男朋友吗？”。当时心里百感交集，从这人眼睛没问题吧——&gt;到我不会真有问题吧。不会吧不会吧？其四，“吐槽协会”的传统请允许我再次将我们这四人组称为“吐槽协会”。考研期间，有两大乐趣，一是休息吹牛批，二是出去吃个大餐。四人组似乎很有默契地达成了共识，选择边吹边吃，==两开花==。什么，你说每次金泽斌都是被硬拉过去的？我不管，这也算是默契！我们会偶尔出去吃个火锅，最青睐的当然是川西集市了。川西打钱。近两公里的路程，就成了吹牛批的专场。从考研数学名师张宇的经sao典hua语录，到最新上映的院线大lan片，都能成为谈资。就是——只要不谈论学习，我们就是兄弟。吃的时候，虽然也互飙骚话，但更多的是障眼法，为的是让自己多吃几块牛羊肉片。在吸引他人注意力的同时，优雅地不动声色地把肉吃掉。每次一吃回来，对于学习就印证了那句话，嗯来劲了！不快散了，但还是觉得可惜当然，期间也有些遗憾的事。最想说的是，期间一个很要好的朋友，因为一件误会，我俩就没联系了。朋友是个很有执行力也很有勇气的人，本身在中国计量大学，考的南大法律系（每年招的人寥寥无几），我心里佩服的一笔，跟我朋友比起来我考研就跟玩一样。也不知道我那朋友现在咋样了，都不敢打个电话问，哎。倒不是因为自己面子问题，我也没啥面子…就是怕朋友过意不去。希望以后能够有缘再联系改革，现在还是觉得后怕其二，今年形势风云诡谲，状况太多了。先是碰上专业课改革，在考研中后期硬生生多了一门课，这门课叫计算机组成原理，学过的人都知道，这玩意邪门的很，学起来可不是一天两天的事。数学也是爆炸难😢。打死也想不到。复试期间，又赶上疫情，复试内容直到前三天才明朗。呆在家的那段时间，可以说是老折磨了，像个上单，被四包一，结果队友还开开心心在线上发育的感觉，总之一个字绝望。效率可以说是人生有史以来最低。如果可以重来，我肯定不选今年（即使今年扩招）。计划简单谈谈自己的计划学业目前联系了一个声望很好的导师，打算进组后踏踏实实工作，做==实体经济==，不搞“虚拟经济”。这是读研期间的原则与底线。踏踏实实做人做学问，才是第一生产力。副业之所以称之为副业，是我真的想在读研期间，好好对待接下来要说的这件事。读研期间，打算兼顾学业，和组建乐队两件“大事”。这是我最大的愿望，我也将不遗余力地去执行，哪怕很辛苦，但是很快乐。关于噪音制造坞本人的小博客上也会不定期更新博文（不全是关于计算机的）和上传平时的吉他cover。有稳定经济来源之后，会立马换一个好记的域名，方便大家访问。 最后看了看身边的同学，无论是高中，还是大学。以后相聚变得越来越难了啊。大家都有自己的工作与事业。前段时间去了久违的胡桃里清吧的时候，酒吧老板也已经换了，换成了一个新的小伙子，就在感慨身边的事物都在前进着，像上次一样这么多高中同学聚在一起的机会似乎也不在有了。如果有机会的话，还是希望大家在一起吹吹牛批，而不是隔着屏幕在那里疯狂输出。很难想象以后的同学会是什么样子，网上调侃说同学会就只是混得好的同学的showtime，那我到时候肯定躲在角落瑟瑟发抖。毕竟身边的同学都这么优秀，说话又好听…。 写到这真的结束了啊手头工作基本做完了，我也该搞事情了，对，摁不住了。最近几天要是我问起你接下来在哪，可别拒绝我，难相在此谢过各位了。虽然我知道也许很少人会真正看到这里，但趁着人少也说说自己平时难以启齿的话，既然我们现在还在联系就是缘分，苟富贵。","path":"2020/05/22/start/"},{"title":"path变量配置出现LRE的问题","text":"关于path变量配置出现LRE的问题今天尝试写一篇博客,讲一讲最近以来配置环境变量的问题。 事情追溯到1个多月以前，配置android以及java的path变量。 但是，无论怎么配置，总会出错 问题出在我并没有手动输入path中的值，而是右键属性把上面的地址复制下来 结果就造成，表面上配置好了，结果在cmd中输入path时，前面会出现LRE字样。上网搜了之后也没有相关解答。纠结了一个晚上，终于想到问题出在，直接复制路径前面会多出一个空格！。 总结，path一定要手动输入，不要贪方便复制粘贴，就算要粘贴也要看看前面的空格。最后，记得重启电脑！","path":"2020/02/18/path/"},{"title":"Hello Hexo~","text":"我会继续完善的~做一个有深 度 的博客 Hello Hexo !","path":"2020/02/18/hello-world/"}]}